// Напишите программу с тремя переменными целого типа, первым двум присвойте значения,
// а третьей переменной присвойте их сумму.
// Выведете значение третей переменной на экран.

package defaults;

public class Task10 {

    public static void main(String[] args) {
        int a, b, s;

        a = 12;
        b = 30;
        s = a + b;
        System.out.println(s);
    }
}
